'''print("    โปรแกรมคํานวณค่าผ่านทางมอเตอร์เวย์")
print("++++++++++++++++++++++++++++++++++++++")
print("    รถยนต์ 4 ล้อ         กด 1")
print("    รถยนต์ 6 ล้อ         กด 2")
print("    รถยนต์มากกว่า 6 ล้อ   กด 3")
print("")
a=int(input("เลือกประเภทยานพาหนะ : "))
thislist =["รถยนต์ 4 ล้อ","รถยนต์ 6 ล้อ","รถยนต์มากกว่า 6 ล้อ"]
price = [["30","45","55","60","80"],["40","45","75","90","100"],["60","70","110","130","140"]]
print('')
print("ค่าบริการรถ",thislist[a-1])
print("ลาดกระบัง-->บางบ่อ =",price[a-1][0],"บาท")
print("ลาดกระบัง-->บางประกง =",price[a-1][1],"บาท")
print("ลาดกระบัง-->พนัสนิคม =",price[a-1][2],"บาท")
print("ลาดกระบัง-->บ้านบึง =",price[a-1][3],"บาท")
print("ลาดกระบัง-->บางพระ =",price[a-1][4],"บาท")'''

'''print("    เลือกเมนูเพื่อทํารายการ")
print("++++++++++++++++++++++++++++++++++++++")
print("    กด 1 เลือกเหมาจ่าย")
print("    กด 2 เลือกจ่ายเพิ่ม")
x = int(input(" "))
print("    กรุณาเลือกระยะทาง")
b = int(input(" "))
if x==1 :
    if b<=25 :
        print("ค่าใช้จ่ายรวมทั้งหมด 25 บาท")
    else:
        print("ค่าใช้จ่ายรวมทั้งหมด 80 บาท")
if x==2 :
    if b<=25 :
        print("ค่าใช้จ่ายรวมทั้งหมด 25 บาท")
    else :
        print("ค่าใช้จ่ายรวมทั้งหมด 55 บาท")'''


'''print("    กรุณากรอกจํานวนครั้งการรับค่า")
x=int(input(" "))
i=0
sum=0
while (i<x):
    b=int(input("กรอกตัวเลข : "))
    i+=1
    sum=sum+b
print("ผลรวมค่าที่รับมาทั้งหมด = "+ str(sum))'''


'''a=[]
while(True):
    b=input('------ร้านยํายํากลางมอ------\n เพิ่ม[a]\n แสดง[s]\n ออกจากระบบ[x]\n')
    b=b.lower()
    if b == 'a':
        c=input('ป้อนรายการลูกค้า(รหัส:ชื่อ:จังหวัด)')
        a.append(c)
        print('\n**********ข้อมูลได้เข้าสู่ระบบแล้ว************\n')
    elif b == 's':
        print('{0:-<6}{0:-<10}{0:-<10}'.format(""))
        print('{0:-<8}{1:-<10}{2:10}'.format('รหัส','ชื่อ','จังหวัด'))
        print('{0:-<6}{0:-<10}{0:-<10}'.format(""))
        for d in a:
            e=d.split(":")
            print('{0[0]:<6} {0[1]:<10}{0[2]:<10})'.format(e))
            continue
    elif b == 'x':
        break'''
print('ทําคําสั่งถัดไป')

'''def Introduce(arg1, arg2 = 'com',arg3 = 'ed' ,arg4 = 'kku'):
    print("Hello, I am"+arg1+" "+arg2+" "+arg3+" "+arg4)
Introduce("python")'''

a=[]
while(True):
    b=input('------พจนานุกรม------\n 1.เพิ่มคําศัพท์[a]\n 2.แสดงคําศัพท์[s]\n 3.ลบคําศัพท์[y]4.ออกจากโปรแกรม[x]\n Input Choice\n ')
    b=b.lower()
    if b == 'a':
        c=input('เพิ่มคําศัพท์(คําศัพท์:ชนิดคํา:ความหมาย)')
        a.append(c)
        print('\n**********เพิ่มคําศัพท์เรียบร้อยแล้ว************\n')
    elif b == 's':
        print('{0:-<20}'.format(""))
        print('{0:-<5} {1:-<5} {2:10}'.format('คําศัพท์','ชนิดคํา','ความหมาย'))
        print('{0:-<20}'.format(""))
        #print('{0:-<6}{0:-<10}{0:-<10}'.format(""))
        for d in a:
            e=d.split(":")
            print('{0[0]:<6} {0[1]:<10}{0[2]:<10})'.format(e))
            continue
    elif b == 'y':
        a.append[b]
        print
    elif b == 'x':
        break
print('ทําคําสั่งถัดไป')
     








    
 








   




        

        

 



